PX4/PX4-Autopilot/nuttx/arch/arm/src/stm32/stm32_otgfsdev.c
/*******************************************************************************
 * Endpoint operations
 *******************************************************************************/

/*******************************************************************************
 * Name: stm32_enablegonak
 *
 * Description:
 *   Enable global OUT NAK mode
 *
 *******************************************************************************/

static void stm32_enablegonak(FAR struct stm32_ep_s *privep)
{
  uint32_t regval;

  /* First, make sure that there is no GNOAKEFF interrupt pending. */

#if 0
  stm32_putreg(OTGFS_GINT_GONAKEFF, STM32_OTGFS_GINTSTS);
#endif

  /* Enable Global OUT NAK mode in the core. */

  regval = stm32_getreg(STM32_OTGFS_DCTL);
  regval |= OTGFS_DCTL_SGONAK;
  stm32_putreg(regval, STM32_OTGFS_DCTL);

#if 0
  /* Wait for the GONAKEFF interrupt that indicates that the OUT NAK
   * mode is in effect.  When the interrupt handler pops the OUTNAK word
   * from the RxFIFO, the core sets the GONAKEFF interrupt.
   */

  while ((stm32_getreg(STM32_OTGFS_GINTSTS) & OTGFS_GINT_GONAKEFF) == 0);
  stm32_putreg(OTGFS_GINT_GONAKEFF, STM32_OTGFS_GINTSTS);

#else
  /* Since we are in the interrupt handler, we cannot wait inline for the
   * GONAKEFF because it cannot occur until service th RXFLVL global interrupt
   * and pop the OUTNAK word from the RxFIFO.
   *
   * Perhaps it is sufficient to wait for Global OUT NAK status to be reported
   * in OTGFS DCTL register?
   */

  while ((stm32_getreg(STM32_OTGFS_DCTL) & OTGFS_DCTL_GONSTS) == 0);
#endif
}

/*******************************************************************************
 * Name: stm32_disablegonak
 *
 * Description:
 *   Disable global OUT NAK mode
 *
 *******************************************************************************/

static void stm32_disablegonak(FAR struct stm32_ep_s *privep)
{
  uint32_t regval;

  /* Set the "Clear the Global OUT NAK bit" to disable global OUT NAK mode */

  regval  = stm32_getreg(STM32_OTGFS_DCTL);
  regval |= OTGFS_DCTL_CGONAK;
  stm32_putreg(regval, STM32_OTGFS_DCTL);
}

/*******************************************************************************
 * Name: stm32_epout_configure
 *
 * Description:
 *   Configure an OUT endpoint, making it usable
 *
 * Input Parameters:
 *   privep    - a pointer to an internal endpoint structure
 *   eptype    - The type of the endpoint
 *   maxpacket - The max packet size of the endpoint
 *
 *******************************************************************************/

static int stm32_epout_configure(FAR struct stm32_ep_s *privep, uint8_t eptype,
                                 uint16_t maxpacket)
{
  uint32_t mpsiz;
  uint32_t regaddr;
  uint32_t regval;

  usbtrace(TRACE_EPCONFIGURE, privep->epphy);

  /* For EP0, the packet size is encoded */

  if (privep->epphy == EP0)
    {
      DEBUGASSERT(eptype == USB_EP_ATTR_XFER_CONTROL);

      /* Map the size in bytes to the encoded value in the register */

      switch (maxpacket)
        {
          case 8:
            mpsiz = OTGFS_DOEPCTL0_MPSIZ_8;
            break;

          case 16:
            mpsiz = OTGFS_DOEPCTL0_MPSIZ_16;
            break;

          case 32:
            mpsiz = OTGFS_DOEPCTL0_MPSIZ_32;
            break;

          case 64:
            mpsiz = OTGFS_DOEPCTL0_MPSIZ_64;
            break;

          default:
            udbg("Unsupported maxpacket: %d\n", maxpacket);
            return -EINVAL;
        }
    }

  /* For other endpoints, the packet size is in bytes */

  else
    {
      mpsiz = (maxpacket << OTGFS_DOEPCTL_MPSIZ_SHIFT);
    }

  /* If the endpoint is already active don't change the endpoint control
   * register.
   */

  regaddr = STM32_OTGFS_DOEPCTL(privep->epphy);
  regval  = stm32_getreg(regaddr);
  if ((regval & OTGFS_DOEPCTL_USBAEP) == 0)
    {
      if (regval & OTGFS_DOEPCTL_NAKSTS)
        {
          regval |= OTGFS_DOEPCTL_CNAK;
        }

      regval &= ~(OTGFS_DOEPCTL_MPSIZ_MASK | OTGFS_DOEPCTL_EPTYP_MASK);
      regval |= mpsiz;
      regval |= (eptype << OTGFS_DOEPCTL_EPTYP_SHIFT);
      regval |= (OTGFS_DOEPCTL_SD0PID | OTGFS_DOEPCTL_USBAEP);
      stm32_putreg(regval, regaddr);

      /* Save the endpoint configuration */

      privep->ep.maxpacket = maxpacket;
      privep->eptype       = eptype;
      privep->stalled      = false;
    }

  /* Enable the interrupt for this endpoint */

  regval = stm32_getreg(STM32_OTGFS_DAINTMSK);
  regval |= OTGFS_DAINT_OEP(privep->epphy);
  stm32_putreg(regval, STM32_OTGFS_DAINTMSK);
  return OK;
}

/*******************************************************************************
 * Name: stm32_epin_configure
 *
 * Description:
 *   Configure an IN endpoint, making it usable
 *
 * Input Parameters:
 *   privep    - a pointer to an internal endpoint structure
 *   eptype    - The type of the endpoint
 *   maxpacket - The max packet size of the endpoint
 *
 *******************************************************************************/

static int stm32_epin_configure(FAR struct stm32_ep_s *privep, uint8_t eptype,
                                uint16_t maxpacket)
{
  uint32_t mpsiz;
  uint32_t regaddr;
  uint32_t regval;

  usbtrace(TRACE_EPCONFIGURE, privep->epphy);

  /* For EP0, the packet size is encoded */

  if (privep->epphy == EP0)
    {
      DEBUGASSERT(eptype == USB_EP_ATTR_XFER_CONTROL);

      /* Map the size in bytes to the encoded value in the register */

      switch (maxpacket)
        {
          case 8:
            mpsiz = OTGFS_DIEPCTL0_MPSIZ_8;
            break;

          case 16:
            mpsiz = OTGFS_DIEPCTL0_MPSIZ_16;
            break;

          case 32:
            mpsiz = OTGFS_DIEPCTL0_MPSIZ_32;
            break;

          case 64:
            mpsiz = OTGFS_DIEPCTL0_MPSIZ_64;
            break;

          default:
            udbg("Unsupported maxpacket: %d\n", maxpacket);
            return -EINVAL;
        }
    }

  /* For other endpoints, the packet size is in bytes */

  else
    {
      mpsiz = (maxpacket << OTGFS_DIEPCTL_MPSIZ_SHIFT);
    }


  /* If the endpoint is already active don't change the endpoint control
   * register.
   */

  regaddr = STM32_OTGFS_DIEPCTL(privep->epphy);
  regval  = stm32_getreg(regaddr);
  if ((regval & OTGFS_DIEPCTL_USBAEP) == 0)
    {
      if (regval & OTGFS_DIEPCTL_NAKSTS)
        {
          regval |= OTGFS_DIEPCTL_CNAK;
        }

      regval &= ~(OTGFS_DIEPCTL_MPSIZ_MASK | OTGFS_DIEPCTL_EPTYP_MASK | OTGFS_DIEPCTL_TXFNUM_MASK);
      regval |= mpsiz;
      regval |= (eptype << OTGFS_DIEPCTL_EPTYP_SHIFT);
      regval |= (eptype << OTGFS_DIEPCTL_TXFNUM_SHIFT);
      regval |= (OTGFS_DIEPCTL_SD0PID | OTGFS_DIEPCTL_USBAEP);
      stm32_putreg(regval, regaddr);

      /* Save the endpoint configuration */

